---
kind: method
id: M:Autodesk.Revit.UI.IIFCEntityTreeUIServer.ShowDialog(Autodesk.Revit.UI.IFCExternalServiceUIData)
source: html/183759b1-f240-4905-223e-5afb5881e03b.htm
---
# Autodesk.Revit.UI.IIFCEntityTreeUIServer.ShowDialog Method

Shows dialog on managing IFCEntityTreeUI.

## Syntax (C#)
```csharp
bool ShowDialog(
	IFCExternalServiceUIData data
)
```

## Parameters
- **data** (`Autodesk.Revit.UI.IFCExternalServiceUIData`) - The data on initializing the dialog as well as getting the result.

## Returns
Whether or not the dialog launches successfully